Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: (Re)run selected run configuration(s)
zh_cn: （重新）运行所选运行配置

source: (Re)run selected run configuration(s) in Debug Mode
zh_cn: 在调试模式下（重新）运行所选运行配置

source: (Read-only)
zh_cn: (只读)

source: (actual attribute value''{0}'')
zh_cn: (实际属性值 ''{0}'')

source: (available for Analyze|Inspect Code)
zh_cn: (用于分析|检查代码)

source: (available for editor highlighting)
zh_cn: (可用于编辑高亮显示)

source: (current value: {0})
zh_cn: (当前值: {0})

source: (disabled)
zh_cn: (禁用)

source: (in this file)
zh_cn: (在此文件中)

source: (in {0})
zh_cn: ({0} 中)

source: (incompatible)
zh_cn: (不兼容)

source: (multiple choices...)
zh_cn: (多重选择...)

source: (no errors)
zh_cn: (没有错误)

source: (none)
zh_cn: (无)

source: (not specified)
zh_cn: (未指定)

source: (press {0} to copy this information to clipboard)
zh_cn: (按 {0} 将此信息复制到剪贴板)

source: ({0,choice,1#1 occurrence|2#{0,number} occurrences})
zh_cn: {0,number} 个匹配

source: ({0} inactive)
zh_cn: ({0} 未激活)

source: ({0} usages)
zh_cn: ({0} 的使用)

source: ({0} {0,choice,1#directory|2#directories})
zh_cn: {0} 个目录

source: ) expected
zh_cn: ) 是预期的

source: , built on {0}
zh_cn: , 建于 {0}

source: - copied from {0}
zh_cn: - 从 {0} 复制

source: - moved from {0}
zh_cn: - 从 {0} 移动

source: - moved to {0}
zh_cn: - 移动到 {0}

source: - negate the pattern (allowed only at the start of a pattern) Use ; (semicolon) to separate resource patterns; Escape the "!" character with a backslash ("\").
zh_cn: - 否定模式（仅在模式开始处允许） Use ; (分号) 来分隔资源模式; 使用反斜杠("\")来转义 "!" 字符。

source: - one character * - zero or more characters !
zh_cn: - 一个字符 * - 0个或更多字符 !

source: - renamed from {0}
zh_cn: - 从 {0} 重命名

source: - renamed to {0}
zh_cn: - 重命名为 {0}

source: - replaced
zh_cn: - 替换

source: -d <directory_path> -- directory to be inspected.
zh_cn: -d <directory_path> -- 要检查的目录。

source: -e -- skip -v[0|1|2] -- verbose level.
zh_cn: -e -- 跳过 -v[0|1|2] -- 详细级别.

source: -profileName -- name of a profile defined in project
zh_cn: -profileName -- 项目中定义的配置文件的名称

source: -profilePath -- absolute path to the profile file
zh_cn: -profilePath -- 配置文件的绝对路径

source: ... ({0} more)
zh_cn: ... ({0} 更多)

source: // Compare nested arrays - values of {0} here
zh_cn: // 在这里比较嵌套数组 - {0} 的值

source: // Probably incorrect - comparing Object[] arrays with Arrays.equals
zh_cn: // 可能不正确 - 比较 Object[] 数组使用 Arrays.equals

source: 0 - silent, 1 - verbose, 2 - most verbose.
zh_cn: 0 - 沉默, 1 - 详细, 2 - 最详细。

source: 1 day
zh_cn: 1 天

source: 1 day left
zh_cn: 剩余1天

source: 1-Year Educational License.
zh_cn: 1年教育许可证。

source: 1.3 - Plain old Java
zh_cn: 1.3 - 古老的 Java

source: 1.4 - 'assert' keyword
zh_cn: 1.4 - 'assert' 关键字

source: 5.0 - 'enum' keyword, generics, autoboxing etc.
zh_cn: 5.0 - 'enum' 关键字，泛型，自动装箱等。

source: 6 - @Override in interfaces
zh_cn: 6 - 接口中的 @Override

source: 7 - Diamonds, ARM, multi-catch etc.
zh_cn: 7 - Diamonds, ARM, 多 catch 等。

source: 8 - Lambdas, type annotations etc.
zh_cn: 8 - Lambdas, 类型注解等。

source: 9 - Modules, private methods in interfaces etc.
zh_cn: 9 - 模块，接口中的私有方法等。

source: : expected
zh_cn: : 是预期的

source: < &Load
zh_cn: < 加载(&L)

source: < Load All
zh_cn: < 加载全部

source: < Use IDE Profile >
zh_cn: < 使用 IDE 配置文件 >

source: <Click to see difference>
zh_cn: <点击查看差异>

source: <Deadlock>
zh_cn: <死锁>

source: <Default Package>
zh_cn: <默认包>

source: <Default>
zh_cn: <默认>

source: <Do not unscramble>
zh_cn: <不解码>

source: <HTML><BODY>Select inspection result on the left to see details</BODY></HTML>
zh_cn: <HTML><BODY>选择左侧的检查结果以查看详细信息</BODY> </HTML>

source: <Module source>
zh_cn: <模块源>

source: <NO TESTS>
zh_cn: <没有测试>

source: <NOT RUN>
zh_cn: <未运行>

source: <No Name>
zh_cn: <没有名字>

source: <No Project SDK>
zh_cn: <无项目 SDK>

source: <No SDK>
zh_cn: <无 SDK>

source: <No name>
zh_cn: <没有名字>

source: <None>
zh_cn: <无>

source: <Not available>
zh_cn: <无法使用>

source: <Project>
zh_cn: <项目>

source: <Stacktrace>
zh_cn: <堆栈跟踪>

source: <System Default: {0}>
zh_cn: <系统默认值：{0}>

source: <The list of build files is empty>
zh_cn: <生成文件列表是空的>

source: <Threads>
zh_cn: <线程>

source: <UNKNOWN>
zh_cn: <未知>

source: <Unknown VCS> ({0})
zh_cn: <未知的 VCS>({0})

source: <Unnamed>
zh_cn: <未命名的>

source: <a href="#">Restart</a>?
zh_cn: <a href="#">重启</a>?

source: <a href="#">Resume {0}</a>
zh_cn: <a href="#">继续 {0}</a>

source: <a href="#">Switch thread</a>
zh_cn: <a href="#">切换线程</a>

source: <a href="#">{0}</a> {1} to activate changes in plugins?
zh_cn: <a href="#">{0}</a> {1} 激活插件中的更改?

source: <a href="http://bugs.sun.com/view_bug.do?bug_id=6624717">More info...</a></body></html>
zh_cn: <a href="http://bugs.sun.com/view_bug.do?bug_id=6624717">更多信息...</a></body></html>

source: <a href="restart">Restart debug session</a>
zh_cn: <a href="restart">重启调试会话</a>

source: <a href="stop">Stop debug session</a>
zh_cn: <a href="stop">停止调试会话</a>

source: <a href="{1}">Show in {2}</a>.
zh_cn: <a href="{1}">在 {2} 中显示</a>。

source: <all other imports>
zh_cn: <所有其他导入>

source: <b> </b><a href="details">Details...</a><br/><br/>Old versions of project files will be saved to: ''{0}''
zh_cn: <b> </b><a href="details">详情...</a><br/><br/>旧版本的项目文件将被保存到:''{0}''

source: <b><a href="updates">Configure</a></b> automatic updates.
zh_cn: <b><a href="updates">配置</a></b> 自动更新。

source: <b><code>{0}</code></b> is not a correct identifier to use in <b><code>{1}</code></b>
zh_cn: <b><code>{0}</code></b> 不是一个正确的标识符，使用于 <b><code>{1}</code></b>

source: <b>A new version of {0} is <a href="#">available</a>!</b>
zh_cn: <b> {0} 的新版已经 <a href="#">可用</a>!</b>

source: <b>{0}</b> {1} found
zh_cn: 发现 <b>{0}</b>{1}

source: <b>{0}</b> {1} found so far
zh_cn: 目前发现 <b>{0}</b>{1}

source: <blank line>
zh_cn: <空行>

source: <br/> For information on how to upgrade your license please go to {1} <br/> You can also opt for a free time-limited evaluation.
zh_cn: <br/>有关如何升级许可证的信息，请访问 {1} <br/> 您还可以选择免费的限时评估。

source: <br/><a href="ack">Do not show again</a>.
zh_cn: <br/><a href="ack">不再显示</a>。

source: <br/>You can also open a project or edit a file by drag and drop onto Welcome screen.
zh_cn: <br/>您也可以通过拖拽到欢迎屏幕来打开项目或编辑文件。

source: <br><br> To attach a library to a module, select that module, click the Dependencies tab, click Add and specify the library location.
zh_cn: <br><br>要将库附加到模块，请选择该模块，单击“依赖关系”选项卡，单击“添加”并指定库位置。

source: <br><br>IntelliJ IDEA Plugin SDK contains idea's libraries and idea's embedded JRE to compile/pack/run/debug plugins for Intellij IDEA.
zh_cn: <br><br> IntelliJ IDEA 插件 SDK 包含 idea 的库和 idea 的嵌入式 JRE 来编译/打包/运行/调试 Intellij IDEA 插件。

source: <br><br>Mobile SDK contains emulator of mobile phone as well as embedded Java SDK to compile/pack/run/debug J2ME applications.
zh_cn: <br><br> Mobile SDK 包含手机模拟器器和嵌入式 Java SDK，用于编译/打包/运行/调试 J2ME 应用程序。

source: <br><br>When you create a J2ME Module or Plugin Module, make sure that you have configured appropriate JDK for such a module.
zh_cn: <br><br>创建 J2ME 模块或插件模块时，请确保为此类模块配置了适当的 JDK。

source: <br>A directory corresponding to each module is created under this path.
zh_cn: <br>在此路径下创建与每个模块对应的目录。

source: <br>Old version was saved to ''{0}''</body></html>
zh_cn: <br>旧版本已保存到 ''{0}''</body></html>

source: <br>This directory contains two subdirectories: Production and Test for production code and test sources, respectively.<br>A module specific compiler output path can be configured for each of the modules as required.</html>
zh_cn: <br>此目录分别包含两个子目录：生产和测试生产代码和测试源。<br>可以根据需要为每个模块配置特定于模块的编译器输出路径。</html>

source: <center>You have selected the intention category ''<b>{0}</b>''.</center>By clicking the checkbox, you can enable/disable all intentions in this category.To enable/disable a particular intention, select the intention inside this category.
zh_cn: <center>您所选择的意向类别 ''<b>{0}</b>''.</center>通过点击复选框，您可以启用/禁用此类别的所有意向。要启用/禁用特定意向，在该类别里面选择意向。

source: <code>null</code> is assigned to a variable that is annotated with @NotNull
zh_cn: <code>null</code> 补赋值给用 @NotNull 注解的变量

source: <code>null</code> is returned by the method declared as @{0}
zh_cn: <code>null</code> 由声明为 @{0} 的方法返回

source: <code>null</code> is returned by the method which is not declared as @{0}
zh_cn: <code>null</code> 由未申明为 @{0} 的方法返回

source: <code>null</code> is stored to an array of @NotNull elements
zh_cn: <code>null</code> 保存到元素 @NotNull 的数组

source: <code>{0}.#ref()</code> will definitely fail as {0} is empty here
zh_cn: <code>{0}.#ref()</code> 一定会失败，因为 {0} 在这里为空

source: <code>{0}.#ref()</code> without ''isPresent()'' check
zh_cn: <code>{0}.#ref()</code> 没有 ''isPresent()'' 检查

source: <default target>
zh_cn: <默认目标>

source: <empty library>
zh_cn: <空库>

source: <empty rule>
zh_cn: <空规则>

source: <empty>
zh_cn: <空>

source: <filename>
zh_cn: <文件名>

source: <html> No in-line parameter name hints will be shown for methods matching any of these patterns.<br> Patterns are matched on fully qualified method name, parameter count and parameter names.
zh_cn: <html>对于匹配任何这些模式的方法，不会显示内嵌参数名称提示。<br>模式在完全限定的方法名称，参数数和参数名称上匹配。

source: <html>"Closures" (anonymous classes implementing one method, before Java 8)</html>
zh_cn: <html>"闭包"(匿名类实现一个方法，Java8之前)</html>

source: <html>''{0}->Semantic highlighting'' from<br>''{1}'' section</html>
zh_cn: <html>''{0}->语义高亮 '' 从<br>''{1}'' 部分</html>

source: <html>''{0}->Spectrum'' from<br>''{1}'' section</html>
zh_cn: <html>''{0}->谱 '' 从<br>''{1}'' 部分</html>

source: <html>''{1}'' plugin is designed as a replacement for currently installed ''{0}'' plugin.<br> Do you want to disable ''{0}'' to avoid possible conflicts?</html>
zh_cn: <html>''{1}'' 插件被设计为替换当前安装的 ''{0}'' 插件。<br>要禁用 ''{0}'' 以避免可能的冲突吗？ </html>

source: <html>(The higher the value is the slower it works.<br> Values greater than 0 cause looking for more abstract code structure)</html>
zh_cn: <html>(值越高，运行越慢。<br> 大于0的值导致寻找更抽象的代码结构)</html>

source: <html><b>&Project SDK:</b><br>This SDK is default for all project modules.<br>A module specific SDK can be configured for each of the modules as required.</html>
zh_cn: <html><b>项目 SDK:(&)</b><br>该 SDK 是所有项目默认。<br>可以根据需要为每个模块配置一个特定于模块的 SDK。</html>(&P)

source: <html><b>Changes will be saved to</b> ''{0}''</html>
zh_cn: <html><b>修改将被保存到</b>''{0}''</html>

source: <html><b>Plugins from configured hosts are ready to update.</b><br> Check plugins you want to update.</html>
zh_cn: <html><b>配置的主机上的插件已准备好更新。</b><br> 选择你想要更新的插件。</html>

source: <html><b>Project compiler output:</b><br>This path is used to store all project compilation results.
zh_cn: <html><b>项目编译输出:</b><br>此路径用于存储所有项目编译结果。

source: <html><b>Project language level:</b><br>This language level is default for all project modules.<br>A module specific language level can be configured for each of the modules as required.</html>
zh_cn: <html><b>项目语言级别:</b><br>访语言级别为所有项目模块的默认值。<br>可以根据需要为每个模块配置模块特定语言级别。</html>

source: <html><b>There are circular dependencies between:</b> {0}</html>
zh_cn: <html><b>存在循环依赖关系:</b> {0}</html>

source: <html><body><center>Please select a template in the tree on the left.</center></body></html>
zh_cn: <html><body><center>请在左边的树中选择一个模板。</center></body></html>

source: <html><body><center>Several files selected.<br>Select occurrences from one file to preview.</center></body></html>
zh_cn: <html><body><center>选中了多个文件。<br>请从一个文件中选择匹配项来预览。</center></body></html>

source: <html><body><font face="verdana" size="-1">You have selected the postfix completion language.<br>By clicking the checkbox, you can enable/disable all postfix templates for the language.<br>To enable/disable a postfix template select it inside the group.<br></font></body></html>
zh_cn: <html><body><font face="verdana" size="-1">你选择了后缀补全语言。<br>通过点击复选框，您可以启用/禁用该类别的所有后缀补全。<br>要启用/禁用一个后缀模板，在该组里选择。<br></font></body></html>

source: <html><body><table border=0><tr><td colspan={0}>Ambiguous method call.
zh_cn: <html><body><table border=0><tr><td colspan={0}>模糊方法调用。

source: <html><body><u>Open Plugin Manager</u></body></html>
zh_cn: <html><body><u>打开插件管理器</u></body></html>

source: <html><body>Cannot set {0} theme:<br>{1}</body></html>
zh_cn: <html><body>无法设置主题 {0}:<br>{1}</body></html>

source: <html><body>Check option above on for per-project code style configuration<br>or use global code style.
zh_cn: <html><body>上面的检查选项用于每个项目的代码样式配置，<br>或使用全局代码样式。

source: <html><body>Choose Implementation of <b>{0}</b> ({1} found{2})</body></html>
zh_cn: <html><body>选择 <b>{0}</b> 的实现方法({1} 找到 {2})</body></html>

source: <html><body>Choose Implementation of <b>{0}</b> ({1} methods found)</body></html>
zh_cn: <html><body>选择 <b>{0}</b> 的实现({1} 个方法已找到)</body></html>

source: <html><body>Choose Overriding Method of <b>{0}</b> ({1} methods found)</body></html>
zh_cn: <html><body>选择 <b>{0}</b> 的重写方法({1} 个方法已找到)</body></html>

source: <html><body>Choose Subclass of <b>{0}</b> ({1} classes found{2})</body></html>
zh_cn: <html><body>选择 <b>{0}</b> 的子类({1} 个类已找到 {2})</body></html>

source: <html><body>Choose Test Subject for <b>{0}</b> ({1} found{2})</body></html>
zh_cn: <html><body>选择 <b>{0}</b> 的测试对象({1} 找到 {2})</body></html>

source: <html><body>Choose Test for <b>{0}</b> ({1} found{2})</body></html>
zh_cn: <html><body>选择 <b>{0}</b> 的测试({1} 找到 {2})</body></html>

source: <html><body>Configure integration with third-party applications, specify the SSH Terminal connection settings, manage server certificates and tasks, configure diagrams layout, etc.
zh_cn: <html><body>配置第三方应用的集成，指定 SSH 终端连接设置，管理服务器证书和任务，配置图表布局等。

source: <html><body>Configure the project Execution settings, set up Deployment options and customize the Debugger behavior.
zh_cn: <html><body>配置项目执行设置，设置部署选项及自定义调试器行为。

source: <html><body>Configure the settings related to specific frameworks and technologies used in your project.
zh_cn: <html><body>配置项目中与具体框架和技术相关的设置。

source: <html><body>Configure your project integration with different build tools: Maven, Gradle or Gant.
zh_cn: <html><body>使用不同的构建工具配置项目集成：Maven, Gradle 或 Gant。

source: <html><body>Documentation for <b>{0}</b> property</body></html>
zh_cn: <html><body> <b>{0}</b> 属性的文档</body></html>

source: <html><body>Don't report assertions with condition statically proven to be always <code>true</code></body></html>
zh_cn: <html><body>不要报告条件静态证明总是 <code>true</code> 的断言</body></html>

source: <html><body>Duplicate string literal found in<br>{0}</body></html>
zh_cn: <html><body>在<br>{0} 找到重复的字符串</body></html>

source: <html><body>For JDK 1.3.x or earlier</body></html>
zh_cn: <html><body>为 JDK 1.3.x 或更早的版本</body></html>

source: <html><body>For JDK 1.4.x</body></html>
zh_cn: <html><body>为 JDK 1.4.x</body></html>

source: <html><body>GTK+ theme is known to be problematic on a JDK prior to 1.6 b12.<br>Please choose another theme, or upgrade your JDK.
zh_cn: <html><body>GTK+ 已知在 JDK 1.6 b12以前有问题。<br>请选择另一个主题，或者升级你的 JDK。

source: <html><body>IDE internal error occurred.<br>Click to see details and submit a bug report.</body></html>
zh_cn: <html><body>IDE 内部错误.<br>单击以查看详细信息并发送 bug 报告给 JetBrains.</body></html>

source: <html><body>If you do not want annotations in your code you may use external storage.<br> To configure external annotations please specify root directory where files with annotations would be placed</body></html>
zh_cn: <html><body>如果您不想在代码中注解，则可以使用外部存储。<br> 要配置外部注解，请指定将放置注释的文件的根目录</body></html>

source: <html><body>Injected element has problem: {0} (in <a href="#navigation/{1}:{2}">{3}</a>).
zh_cn: <html><body>注入元素有问题: {0} (in <a href="#navigation/{1}:{2}">{3}</a>).

source: <html><body>Multiple libraries contain the file.<br>Choose libraries to attach sources to</body></html>
zh_cn: <html><body>多个库包含文件。<br>选择要附加源的库</body></html>

source: <html><body>New projects can either be opened in a new window or replace the project in the existing window.<br>How would you like to open the project?</body></html>
zh_cn: <html><body>新项目可以在新窗口中打开，也可以替换现有窗口中的项目。<br>你想如何打开项目？</body></html>

source: <html><body>Personalize IDE appearance and behavior: change themes and font size, tune the keymap, configure plugins and system settings, such as password policies, HTTP proxy, updates and more.
zh_cn: <html><body>个性化 IDE 的外观和行为：更改主题和字体大小，调整快捷键，配置插件和系统设置，如密码策略，HTTP 代理，更新等。

source: <html><body>Personalize source code appearance by changing fonts, highlighting styles, indents, etc.
zh_cn: <html><body>个性化源码外观，如改变字体，高亮样式，缩进等。

source: <html><body>Please read the following license agreement carefully.<br>To proceed you must agree to all terms of this license by selecting the checkbox.</html></body>
zh_cn: <html><body>请仔细阅读以下许可协议。<br>要继续，您必须通过选择复选框来同意本许可证的所有条款。</html></body>

source: <html><body>Project Settings
zh_cn: <html><body> 项目设置

source: <html><body>Replace {0} occurrences of ''{1}'' across<br>{2} files with ''{3}''?
zh_cn: <html><body>用 ''{3}'' 替换 {2} 个文件中的 {0} 个 ''{1}'' 匹配项?

source: <html><body>Replace {0} occurrences of ''{1}''<br>across {2} files with ''{3}''?
zh_cn: <html><body>用 ''{3}'' 替换 {2} 个文件中的 {0} 个 ''{1}'' 匹配项?

source: <html><body>Replace {0} ocurrences of ''{1}'' across<br>{2} files with ''{3}''?
zh_cn: <html><body>用 ''{3}'' 替换 {2} 个文件中的 {0} 个 ''{1}'' 匹配项?

source: <html><body>Settings that are related to non-bundled custom plugins and are not assigned to any other category.
zh_cn: <html><body>非绑定的自定义插件相关的设置，不分配给任何其他类别。

source: <html><body>Several frameworks are detected in the project.
zh_cn: <html><body>在项目中检测到几个框架。

source: <html><body>Suggest @Nullable annotation for methods that may possibly return null and <br>report nullable values passed to non-annotated parameters</body></html>
zh_cn: <html><body>建议 @Nullable 标注的方法可能返回 null 以及 <br>报告传递到非注解的参数为空的值</body></html>

source: <html><body>TODO check has skipped {0,choice, 0#|1#one file|2#{0} files}.<br/> No new or edited TODO items, or items located in changed text fragments were found.</body></html>
zh_cn: <html><body>TODO 检查跳过 {0} 个文件。<br/> 没有新建或编辑的 TODO 项，或没有找到更改的文本片断中的项。</body></html>

source: <html><body>Template data languages are the underlying languages in template files like those of FreeMarker/Velocity frameworks.<br>To change template data language settings {0} uses for a file, a directory, or the entire project, add its path if necessary and then select a language from the drop down list.<br><br><br></body></html>
zh_cn: <html><body>模板数据语言是模板文件中的底层语言，如 FreeMarker/Velocity 框架。<br>要为文件、目录或整个项目更改模板数据语言的设置 {0}，添加它的路径（如果需要），然后从下拉列表中选择一门语言。<br><br><br></body></html>

source: <html><body>Template data languages are the underlying languages in template files like those of FreeMarker/Velocity frameworks.<br>To change template data language settings {0} uses for a file, a directory, or the entire project, click an item and then select a language from a drop down list.<br><br><br></body></html>
zh_cn: <html><body>模板数据语言是模板文件中的底层语言，如 FreeMarker/Velocity 框架。<br>要为文件、目录或整个项目更改模板数据语言的设置 {0}，点击一项，然后从下拉列表中选择一门语言。<br><br><br></body></html>

source: <html><body>The current project is configured to use its own code style.<br>Changes made to global code style settings will not affect formatting in the current project.<br>See Project Settings | Code Style.<br>Press \&quot;Edit Global Settings\&quot; button below if you still want to edit global settings.</body></html>
zh_cn: <html><body>当前项目配置为使用自己的代码样式。<br>对全局代码样式设置所做的更改不会影响当前项目的格式。<br>如果你还想编辑全局设置，请按 \&quot;Edit Global Settings\&quot; </body></html>

source: <html><body>The following files are read only.
zh_cn: <html><body>以下文件是只读的。

source: <html><body>The following files don''t exists: <br>{0}The corresponding modules won''t be converted.
zh_cn: <html><body>以下文件不存在: <br>{0} 相应的模块将不会被转换。

source: <html><body>There are possible side effects found in expressions assigned to the variable ''{0}''<br>You can:<ul><li><b>Remove</b> variable usages along with all expressions involved</li></body></html>
zh_cn: <html><body>在赋值给变量 ''{0}'' 的表达式中有可能出现副作用<br>你可以:<ul><li><b>移除</b> 变量用法与所有表达式一起</li></body></html>

source: <html><body>To manage run configuration in Run Dashboard add its type.<body></html>
zh_cn: <html><body>要在运行 Dashboard 中管理运行配置，请添加其类型。<body></html>

source: <html><body>Unable to read Tip Of The Day ({0}).
zh_cn: <html><body>无法读取每日提示 ({0})。

source: <html><body>Use the following command line arguments for running remote JVM</body></html>
zh_cn: <html><body>使用以下命令行参数来运行远程 JVM</body></html>

source: <html><body>While generally incompliant to Object.equals() specification accepting<br>subclasses might be necessary for generated method to work correctly<br>with frameworks, which generate Proxy subclasses like Hibernate.</body></html>
zh_cn: <html><body>虽然在 Object.equals() 的规范通常不接受子类，<br>但为了在框架能正常工作，接受子类可能是必须的。<br>就像 Hibernate 生成代理子类一样。</body></html>

source: <html><body>Your module was successfully converted.
zh_cn: <html><body>您的模块已成功转换。

source: <html><body>{0, choice, 1#One|2#{0}} added/edited TODO {0,choice, 1#item|2#items},<br/>and {1, choice, 1#one item|2#{1} items} located in changed fragments were found.<br/>Would you like to review them?<br/>{2,choice, 0#|1#One file was skipped.|2#{2} files were skipped.}</body></html>
zh_cn: <html><body>找到 {0} 个添加/编辑的 TODO 项,<br/> 并且 {1} 项位于更改的片断中。<br/>你想要回顾他们吗？<br/>{2} 个文件已跳过。</body></html>

source: <html><body>{0,choice, 0#|1#One|2#{0}} added/edited TODO {0,choice, 0#|1#item was|2#items were} found.<br/>Would you like to review {0,choice,1#it|2#them}?<br/>{1,choice, 0#|1#One file was skipped.|2#{1} files were skipped.}</body></html>
zh_cn: <html><body>找到 {0} 个添加/编辑的 TODO 项。<br/> 你想要回顾{0,choice,1#它|2#它们}吗?<br/>{1} 个文件已跳过。</body></html>

source: <html><body>{0,choice, 1#One|2#{0}} TODO {0,choice, 1#item was|2#items were} found in changed fragments.<br/>Would you like to review {0,choice,1#it|2#them}?<br/>{1,choice, 0#|1#One file was skipped.|2#{1} files were skipped.}</body></html>
zh_cn: <html><body>在更改的片断中找到 {0} 个 TODO 项。<br/>你想要回顾{0,choice,1#它|2#它们}吗?<br/>{1} 个文件已跳过。</body></html>

source: <html><body>{0} ''<b>{1}</b>'' in {2}</body></html>
zh_cn: <html><body>{0}''<b>{1}</b>'' 在 {2}</body></html>

source: <html><center>Enter a shortcut here: <br>single or double-click, scroll the wheel,<br> modify with Ctrl, Alt and Shift
zh_cn: <html><center>在这里输入一个快捷方式: <br>单击或双击，滚动滚轮,<br> 用 Ctrl，Alt 和 Shift 进行修改

source: <html><code>void main(String args[])</code> methods</html>
zh_cn: <html><code>void main(String args[])</code> 方法</html>

source: <html><div style="text-align:right" vertical-align="top">''{0}->Semantic highlighting''<br>of <a href="{1}">{2}</html>
zh_cn: <html><div style="text-align:right" vertical-align="top">''{0}->语义高亮''<br>of <a href="{1}">{2}</html>

source: <html><font color=gray><sub>Assign each parameter or variable<br>its own color from the spectrum below:
zh_cn: <html><font color=gray><sub>分配每个参数和局部变量其自己的颜色<br>从下面的光谱中选出：

source: <html><p style="line-height: 150%;">The plugins below cannot function at the same time.
zh_cn: <html><p style="line-height: 150%;">下面的插件不能同时运行。

source: <html><u>P</u>lease fill in any details that may be important: steps to reproduce, what were you doing when problem occurred, etc.:</html>
zh_cn: <html><u>请</u>填写可能重要的任何细节:重现步骤，当问题发生时，你在做什么等.</html>

source: <html>Activate left neighbouring tab</html>
zh_cn: <html>激活左边邻近的选项卡</html>

source: <html>Activate most recently opened tab</html>
zh_cn: <html>激活最近打开的选项卡</html>

source: <html>Activate right neighbouring tab</html>
zh_cn: <html>激活右边邻近的选项卡</html>

source: <html>Annotations</html>
zh_cn: <html>注释</html>

source: <html>Anonymous classes</html>
zh_cn: <html>匿名类</html>

source: <html>Are you sure to disable plugin <b>{0}</b>?<br/>Functionality provided by the plugin will no longer be available.</html>
zh_cn: <html>确实要禁用插件 <b>{0}</b>?<br/>该插件提供的功能将不再可用.</html>

source: <html>Are you sure you would like to disable plugin <b>{0}</b>?<br/>Functionality provided by the plugin and dependent plugins will no longer be available.</html>
zh_cn: <html>您确实想要禁用插件 <b>{0}</b> 吗?<br/>该插件及依赖该插件的提供的功能将不再可用.</html>

source: <html>Automatically position mouse cursor on default button</html>
zh_cn: <html>自动将鼠标光标置于默认按钮上</html>
